/*================================ 运算符详解 ================================*/

/*---------------- 算数运算符 ----------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	//+    -   *   /   %
//	int a = 1, b = 2;
//	printf("%d\n",a + b);//3
//	printf("%d\n",a - b);//-1
//	printf("%d\n",a * b);//2
//	
//	int c = 5, d = 2;
//	printf("%d\n", c / d);//2
//	//如果需要小数位则需要用浮点数接受，且必须任意一位数为浮点数
//	float f = 5.0f / 2.0f;//不带f默认double类型
//	printf("%f\n",f);//2.5
//
//	//float e = 10 % 3.0;//error  % 运算符的两个数必须为整数。返回的是整除之后的余数
//	int e = 10 % 3;//error  % 运算符的两个数必须为整数。返回的是整除之后的余数
//	printf("%d",e);//1
//}

/*---------------- 移位运算符 ----------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	/*
//	* << 左移运算符
//	* 规则:左边抛弃，右边补0
//	*/
//	int a1 = 3;
//	//当a1为正数时
//	//原码=反码=补码 所以直接左移一位即可
//	printf("a1 = %d\n", a1 << 1);//6
//	int a2 = -4;
//	//当a2为负数时
//	//原码转补码然后左移一位，再转回原码
//	printf("a2 = %d\n", a2 << 1);//-8
//
//	/*
//	* >> 右移运算符
//	* 规则：
//	*	1.算术右移:左边用原舍弃的符号位填充，右边舍弃
//	*	2.逻辑右移:左边补0，右边舍弃
//	*/
//	int b1 = 5;
//	printf("b1 = %d\n", b1 >> 1);//2
//	int b2 = -3;
//	printf("b2 = %d\n", b2 >> 1);//-2
//
//	//int e = 2;
//	//printf("e = %d\n",e << -2);//error
//}

/*---------------- 位运算符 ----------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	//&:按(二进制)与。同为1才为1
//	int a1 = 2, b1 = 6;
//	//为正整数时，原、反、补一致
//	//a1:		  00000000000000000000000000000010
//	//b1:		  00000000000000000000000000000110
//	//a1&b1:	  00000000000000000000000000000010
//	printf("a1 & b1 = %d\n",a1 & b1);//2
//	int a_1 = -2, b_1 = -6;
//	//为负整数时，原、反、补不一致
//	//补码a_1:    11111111111111111111111111111110
//	//补码b_1:    11111111111111111111111111111010
//	//a_1&b_1补码:11111111111111111111111111111010
//	//a_1&b_1反码:10000000000000000000000000000101
//	//a_1&b_1原码:10000000000000000000000000000110
//	printf("a_1 & b_1 = %d\n", a_1 & b_1);//-6
//
//	//|:按(二进制)或。任意一位为1，结果就为1
//	int a2 = 3, b2 = 2;
//	//a2:		  00000000000000000000000000000011
//	//b2:		  00000000000000000000000000000010
//	//a2&b2:	  00000000000000000000000000000011
//	printf("a2 | b2 = %d\n",a2 | b2);//3
//
//	//^:按(二进制)异或。相同为0，相异为1
//	int a3 = 6, b3 = 5;
//	//a3:		  00000000000000000000000000000110
//	//b3:		  00000000000000000000000000000101
//	//a3&b3:	  00000000000000000000000000000011
//	printf("a3 ^ b3 = %d\n",a3 ^ b3);//3
//}
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
void main() {
	int a = 3, b = 5;
}