/*================================ 运算符详解 ================================*/

/*---------------- 算数运算符 ----------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	//+    -   *   /   %
//	int a = 1, b = 2;
//	printf("%d\n",a + b);//3
//	printf("%d\n",a - b);//-1
//	printf("%d\n",a * b);//2
//	
//	int c = 5, d = 2;
//	printf("%d\n", c / d);//2
//	//如果需要小数位则需要用浮点数接受，且必须任意一位数为浮点数
//	float f = 5.0f / 2.0f;//不带f默认double类型
//	printf("%f\n",f);//2.5
//
//	//float e = 10 % 3.0;//error  % 运算符的两个数必须为整数。返回的是整除之后的余数
//	int e = 10 % 3;//error  % 运算符的两个数必须为整数。返回的是整除之后的余数
//	printf("%d",e);//1
//}

/*---------------- 移位运算符 ----------------*/
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
void main() {
	/*
	* << 左移运算符
	* 规则:左边抛弃，右边补0
	*/
	int a1 = 3;
	//当a1为正数时
	//原码=反码=补码 所以直接左移一位即可
	printf("a1 = %d\n", a1 << 1);//6
	int a2 = -4;
	//当a2为负数时
	//原码转补码然后左移一位，再转回原码
	printf("a2 = %d\n", a2 << 1);//-8

	/*
	* >> 右移运算符
	* 规则：
	*	1.算术右移:左边用原舍弃的符号位填充，右边舍弃
	*	2.逻辑右移:左边补0，右边舍弃
	*/
	int b1 = 5;
	printf("b1 = %d\n", b1 >> 1);//2
	int b2 = -3;
	printf("b2 = %d\n", b2 >> 1);//-2

	//int e = 2;
	//printf("e = %d\n",e << -2);//error
}