/*======================================作用域、生命周期、常量===========================================*/

/*--------------------------作用域--------------------------*/
//局部变量作用域：就是变量所在的函数体内的局部范围
//全局变量作用域：整个工程可用，如果要跨文件使用则需要加上 extern 类型 变量名;即可

//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//int g_val = 100;
//void main(){
//	printf("全局变量1：%d\n", g_val);
//	{
//		int a = 10;
//		printf("局部变量：%d\n", a);
//		printf("全局变量2：%d\n", g_val);
//	}
//	printf("全局变量3：%d\n", g_val);
//	
//}

/*-----------------测试跨源文件获取变量值-------------------*/

//此时g_val这个变量是属于另一个源文件的，如果当前文件也要使用这个变量则需要加上 extern 类型 变量名;即可

//证明了全局变量是属于整个工程的
//全局变量作用域：整个工程可用，如果要跨文件使用则需要加上 extern 类型 变量名;即可
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//extern int g_val;
//void main() {
//	printf("%d",g_val);
//}

/*------------------------生命周期-----------------------*/

//局部变量生命周期：从变量创建的函数块中开始，出所在函数块就销毁
//全局变量生命周期：整个程序的生命周期，从程序第一行代码开始到最后一行代码结束
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	{
//		//变量a的生命开始
//		int a = 10;
//	}//到此处a的生命销毁
//}

/*-------------------------常量------------------------*/
/*
* C语言常量可分为以下几种：
* 1.字面常量
* 2.const 修饰的常变量
* 3.#define 定义的标识符常量
* 4.枚举常量
*/

//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//
//	//1.字面常量
//	3.14;
//	20;
//
//	//2.const 修饰的常变量 不能改变，但本质上还是一个变量
//	const int a = 10;
//	/*
//	* 证明a常变量本质还是个变量如下：
//	* 数组的长度必须是常量，从这里可以证明，如果10换成被const
//	* 修饰的a变量就会报错，从而证明const修饰本质还是变量
//	 */
//	//int arr[a] = { 0 };Error
//
//	//3.#define 定义的标识符常量
//	#define x 100;
//	int b = x;
//	//x = 200;Error
//}
/*-----------4.枚举常量-----------*/
//#define _crt_secure_no_warnings
//#include <stdio.h>
//enum sex{
//	male = 4,//可以赋初值，后面的值按顺序。默认0开始
//	female,
//	secret
//};
//void main() {
//	enum sex s1 = male;
//	enum sex s2 = female;
//	enum sex s3 = secret;
//	//secret = 0;error
//	printf("%d\n", s1);
//	printf("%d\n", s2);
//	printf("%d\n", s3);
//}

/*======================================字符串+转义字符+注释===========================================*/

/*------------------------字符串-----------------------*/

/*
 * 字符串的结束标志是一个\0的转义字符。在计算字符串长度的时候\0是结束标志
 * 不属于字符串内容，也不影响字符串的长度，如果是一个个字符元素则需要手动添加\0
 */

/*
* 第一种证明方法：可以用监视窗口证明数组最后一位是\0
* 1.F10-逐步步入 快捷键F11
* 2.调试-窗口-监视 或使用快捷键Ctrl+Alt+W,1即可看到数组中的内容
*/
//#include <stdio.h>
//void main() {
//	char arr1[] = "abc";
//	char arr2[] = {'a','b','c'};
//	char arr3[] = {'a','b','c','\0'};
//	/*
//	* abc 打印是从字符'a'开始的，打印完字符'c'后
//	*     会碰到字符串结束标志 \0，打印结束
//	*/
//	printf("arr1:%s\n",arr1);
// 
//	/*
//	* abc乱码 原因：没有结束标志\0，所以程序会认为arr2没有打
//	*		  印结束，数组又是存在内存中的，所以会继续打印
//	*/
//	printf("arr2:%s\n",arr2);
//	printf("arr3:%s",arr3);//输出结果和arr1相同
//}

/*
* 第二种证明方法：可以利用 strlen() 函数证明
* strlen():用于返回字符串长度，需要引入string.h头文件
*/
//#include <stdio.h>,<string.h>
//void main() {
//	char arr1[] = "abc";
//	char arr2[] = { 'a','b'};
//	char arr3[] = { 'a','b','c','\0'};
//	//3 因为打印到结束标志\0就结束了
//	printf("%d\n",strlen(arr1));
//
//	/*不确定 原因：没有结束标志，所以会一直打印，直到
//	 *			   内存中出现，字符串长度也就不确定
//	 */
//	printf("%d\n",strlen(arr2));
//	printf("%d\n",strlen(arr3));//结果和arr1相同
//}

/*------------------------转义字符-----------------------*/
//#include <stdio.h>,<string.h>
//void main() {
//	//测试转义字符
//	//printf("\a");//							响铃				\a
//	//printf("%s","abc\bdef");//abdef			退格				\b
//	//printf("%s","abc\fdef");//abc回车def		分页				\f
//	//printf("%s","abc\ndef");//abc回车def		换行				\n
//	//printf("%s","abc\rdef");//def				回车				\r
//	//printf("%s","abc\tdef");//abc    def		制表符			\t
//	//printf("%s","abc\vdef");//abc回车def		垂直制表			\v
//	//printf("%s","C:\\Users");//C:\Users		反斜字符"\"		\\                                '
//	//printf("%c", '\'');//'						单引号字符		\'
//	//printf("%s", "\"");//"						双引号字符		\"
//	//printf("%s", "\?");//?						问号				\?
//	//printf("%c", "\0");//						空字符			\0
//
//	//1到3位八进制所代表的任意字符	\ddd
//	//printf("%c", '\101');//A		八进制---十进制---ASCII	
//	//							     101		   65	   'A'
//
//	//十六进制所代表的任意字符		\xdd
//	//printf("%c", '\x32');//2		十六进制---十进制---ASCII
//	//								   32		 50	     '2'
//
//	//\t，\62，\t各算一个字符，所以字符串长度为12
//	//printf("%i",strlen("c:\test\628\test"));//12
//}

/*--------------------------注释-------------------------*/
//#include <stdio.h>
//void main() {
//	//两种注释风格
//	//int a = 0;		C++注释风格
//	/*
//	* int b = 0;		C注释风格，缺陷：不能嵌套注释
//	*/
//	
//}

/*============================================选择语句=============================================*/
//#define _CRT_SECURE_NO_WARNINGS 
//#include <stdio.h>
//void main() {
//	int input;
//	printf("选择你的人生\n1Q:你要好好学习吗？(1/0)\n");
//	scanf("%d",&input);
//	if (input == 1) printf("降维打击");
//	else printf("摆烂的一生");
//}

/*============================================循环语句=============================================*/
//#include <stdio.h>
//void main() {
//	int line = 0;
//	while (line < 3000) {
//		printf("写代码：%d\n",line);
//		line++;
//	}
//	if (line == 3000) printf("好工作");
//}

/*=============================================函数==============================================*/
//#define _CRT_SECURE_NO_WARNINGS 
//#include <stdio.h>
//原代码：
//void main() {
//	int num1, num2;
//	scanf("%d %d", &num1, &num2);
//	printf("%d", num1 + num2);
//}
//使用加法函数：
//void main() {
//	int num1, num2;
//	scanf("%d %d",&num1,&num2);
//	printf("%d", add(num1, num2));
//}
//int add(int a,int b) {
//	return a + b;
//}

/*=============================================数组==============================================*/
//#define _CRT_SECURE_NO_WARNINGS 
//#include <stdio.h>
//void main(){
//	//定义数组：类型 数组名[常量值] = {元素};
//	//char ch[5] = {'a','b','c'};//不完全初始化，剩余的元素为0
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int i = 0;
//	//因为总共10个元素，下标最大为9，所以不能>=10，下标为10的元素不存在
//	while (i < 10) {
//		printf("%i\n", arr[i]);
//		i++;
//	}
//}

/*=============================================运算符==============================================*/
/*--------------------------算术运算符-------------------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	//算术运算符：+ - * / %(取模)
//	int a = 1 + 2;//3
//	int b = 3 - 1;//2
//	int c = 1 * 2;//2
//	int d = 9 / 2;//4
//	float e = 9 / 2.0;//4.5 
//	//注意：当除数或被除数有一个是浮点数结果才会是浮点数
//	int f = 9 % 2;//1
//}

/*--------------------------移位运算符-------------------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	//移位运算符：>>(右移运算符) <<(左移运算符) 
//	//移位运算符移动的是二进制数
//	int i = 2;
//	//2转二进制是10，向左移1位就是100转十进制就是4
//	int a = 2 << 1;//4
//	//4转二进制是100，向右移2位就是001转十进制就是1
//	int b = a >> 2;//1
//}

/*--------------------------位运算符-------------------------*/
//#define _crt_secure_no_warnings
//#include <stdio.h>
//void main() {
//	//位运算符：与或非，和java类似
//	/*
//	* c语言中 非0为真，0为假
//	* &：与，两边同时满足条件结果才是true，否则false
//	* |：或，任意一边满足条件结果就是true
//	* ^：非，取反，结果若为true则为false
//	*/
//	int a = 1,b = 0;
//	int c = a & b;//0
//	int d = a | b;//1
//	int e = a ^ b;//1
//}

/*--------------------------赋值运算符-------------------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	//赋值运算符：= += -= *= /= &= ^=  |=    >>=   <<=
//	int a = 5;
//	a += 5;//10
//	a -= 5;//5
//	a *= 2;//10
//	a /= 2;//5
//
//	a & 1;//1
//	a | 1;//5
//	a ^ 5;//0
//	
//	a >>= 1;//2
//	a <<= 1;//4
//}

/*--------------------------单目运算符-------------------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	//int i = 1;
//	//printf("%d\n",!i);//0				!取反  
//	//printf("%d\n",-i);//-1				- 负值
//	//printf("%d\n",+i);//1				+ 正值
//	//printf("%d\n",&i);//内存地址		& 取地址 
//	//printf("%d\n",sizeof(i));//4		sizeof类型/变量/数组大小单位字节
//	//int t = (int)3.14;					//(类型)强制类型转换
//	//printf("%d",t);//1.0000
//
//	////--前置、后置--
//	////++前置、后置++ 
//	////前置时是先运算后赋值，后置时是先赋值后运算
//	//int a1 = 10;
//	//int b1 = --a1;
//	//printf("%d\n",a1);//9
//	//printf("%d\n",b1);//9
//	//int a2 = 10;
//	//int b2 = a2++;
//	//printf("%d\n", a2);//11
//	//printf("%d\n", b2);//10
//
//	//int* p = 1;
//	//printf("%d",p);//1					* 间接访问操作符(解引用操作符)
//
//	//printf("%d\n", ~7);//-8			~对一个数的二进制按位取反 
//}

/*--------------------------关系运算符-------------------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	//关系运算符：>    >=    <    <=    !=    ==
//	printf("%d\n",1 > 2);//0
//	printf("%d\n",1 >= 2);//0
//	printf("%d\n",1 < 2);//1
//	printf("%d\n",1 <= 2);//1
//	printf("%d\n",1 != 2);//1
//	printf("%d\n",1 == 2);//0
//}

/*--------------------------逻辑运算符-------------------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	//逻辑运算符：&& 逻辑与，|| 逻辑或
//	int a = 1, b = 2;
//	//false &&：两边同时满足条件结果才是true，否则false
//	if (a == 1 && b == 1) printf("true\n");
//	else printf("false\n");
//	//true  ||：任意一边满足条件结果就是true
//	if (a == 1 || b == 1) printf("true\n");
//	else printf("false\n");
//}

/*------------------条件运算符(三目运算符)--------------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	//条件运算符(三目运算符)：exp1 ? exp2 : exp3
//	//表达式1成立则执行表达式2，否则执行表达式3
//	int a = 1;
//	printf(a == 1 ? "a为1":"a不为1");
//}

/*--------------------------逗号表达式-------------------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	int a = 0, b = 3, c = 5;
//	//逗号表达式：exp1, exp2, exp3, …expN
//	//从左到右依次运算
//	//        a = 4      b = 6     c = 10
//	int i = (a = b + 1,b = a + 2,c = a + b);
//	printf("%d",i);//10
//}

/*---------------下标引用、函数调用和结构成员操作符----------------*/
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
//创建了一个自定义类型 类似java中的类
struct  Person {
	//结构体的成员变量
	char name[10];
	int age;
	int height;
};
void main() {
	//[] () . ->
	int arr[3] = {1,2,3};
	printf("%d",arr[2]);////[]:下标引用
	printf("hello");//():函数调用

	//自定义类型的初始化，要使用 {参数对应结构体中的成员变量}
	struct  Person p1 = {"张三",18,183};
	//访问结构体变量的方式：结构体名.成员名
	printf("姓名：%s\n年龄：%d\n身高：%d\n", p1.name,p1.age,p1.height);

	//p1是一个结构体变量，那么在内存中一定有他的地址。
	//pb能存放p1的地址，那pb一定是一个指针。
	//指向整型的叫整型指针，指向字符的叫字符型指针，而pb是结构体指针
	struct Person* pb = &p1;
	//结构体指针访问成员的方式：结构体指针->成员名
	printf("姓名：%s\n", pb->name);
	printf("年龄：%i\n", pb->age);
	printf("身高：%i\n", pb->height);

	//使用(*pb)来对pb解应用，就是b了
	printf("姓名：%s\n", (*pb).name);
	printf("年龄：%i\n", (*pb).age);
	printf("身高：%i\n", (*pb).height);
}

/*=============================================Day02结束==============================================*/