/*======================================== 一维数组 ========================================*/
/*------------------------数组的创建------------------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//void main() {
//	//数组创建的方式：类型 数组名[数组长度];
//	//注意：数组长度必须为常量表达式
//	int arr[10];
//	int len = 5;
//	//int error[len];//error
//}

/*------------------------数组的初始化------------------------*/
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//#include <string.h>
//void main() {
//	//数组初始化顾名思义就是在创建数组的同时给数组的内容一些合理初始值
//	int arr1[10] = { 1,2,3,4,5,6,7,8,9,10 };//完全初始化
//	//整形数组默认值为0   1234500000
//	int arr2[10] = { 1,2,3,4,5 };//不完全初始化
//	//如果没有指定长度，那么就会根据初始化的元素个数来确定大小
//	int arr3[] = { 1,2,3,4,5 };
//	
//	//字符类型数组默认值为\0
//	char ch1[4] = {'a','b','c'};
//
//	//abc\0
//	char ch2[] = "abc";
//	//abc乱码
//	char ch3[] = {'a','b','c'};
//	printf("%s\n",ch2);//abc
//	printf("%s\n",ch3);//abc乱码
//	printf("%d\n",strlen(ch2));//abc
//	printf("%d",strlen(ch3));//不确定
//
//}

/*------------------------数组的使用------------------------*/
//#include <stdio.h>
//void main() {
//	//数组不完全初始化
//	int arr[10] = {0};
//	//计算数组的元素个数
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	//数组是通过下标来访问的，下标从0开始
//	int i = 0;//下标
//	//第五个元素赋值为5
//	arr[4] = 5;//[] - 数组下标引用符
//	//输出数组的内容
//	for (i = 0; i < 10;i++) {
//		printf("%d ",arr[i]);
//	}
//}

/*------------------------ 一维数组在内存中的存储 ------------------------*/
#include <stdio.h>
void main() {
	int arr[10] = {0};//不完全初始化
	for (int i = 0; i < 10;i++) {
		//%p;打印地址的格式,十六进制
		printf("&arr[%d] = %p\n",i,&arr[i]);//&:打印内存地址
	}
}